Revit 2027 API
ConstraintToRebarEdgeProperties.DistanceToTargetRebar Property
 The distance to the target rebar's edge. The default value is 0.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double DistanceToTargetRebar { get; set; }
Public Property DistanceToTargetRebar As Double
	Get
	Set
public:
property double DistanceToTargetRebar {
	double get ();
	void set (double value);
}
member DistanceToTargetRebar : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for distanceToTargetRebar must be no more than 30000 feet in absolute value.
See Also
Reference
ConstraintToRebarEdgeProperties Class
Autodesk.Revit.DB.Structure Namespace